The [terraform file](https://github.com/hail-is/hail/commits/main/infra/main.tf) underwent a lot of refactoring and applying it involves a lot of changes.

Wanted to check with you guys if there is anything that looks dangerous. A few buckets to be destroyed (batch_logs, hail_query) might be something that we don't want?

```terraform
  # google_artifact_registry_repository_iam_member.artifact_registry_ci_viewer must be replaced
-/+ resource "google_artifact_registry_repository_iam_member" "artifact_registry_ci_viewer" {
      ~ etag       = "BwXGf3cJBw4=" -> (known after apply)
      ~ id         = "projects/hail-295901/locations/australia-southeast1/repositories/hail/roles/artifactregistry.reader/serviceaccount:ci-c1d4@hail-295901.iam.gserviceaccount.com" -> (known after apply)
      ~ member     = "serviceAccount:ci-c1d4@hail-295901.iam.gserviceaccount.com" -> (known after apply) # forces replacement
      ~ project    = "hail-295901" -> (known after apply)
      ~ repository = "projects/hail-295901/locations/australia-southeast1/repositories/hail" -> "hail"
        # (2 unchanged attributes hidden)
    }

  # google_artifact_registry_repository_iam_member.artifact_registry_viewer must be replaced
-/+ resource "google_artifact_registry_repository_iam_member" "artifact_registry_viewer" {
      ~ etag       = "BwXGf3cJBw4=" -> (known after apply)
      ~ id         = "projects/hail-295901/locations/australia-southeast1/repositories/hail/roles/artifactregistry.reader/serviceaccount:ci-c1d4@hail-295901.iam.gserviceaccount.com" -> (known after apply)
      ~ member     = "serviceAccount:ci-c1d4@hail-295901.iam.gserviceaccount.com" -> (known after apply) # forces replacement
      ~ project    = "hail-295901" -> (known after apply)
      ~ repository = "projects/hail-295901/locations/australia-southeast1/repositories/hail" -> "hail"
        # (2 unchanged attributes hidden)
    }

  # google_project_iam_member.auth_service_account_admin will be destroyed
  - resource "google_project_iam_member" "auth_service_account_admin" {
      - etag    = "BwXKLgcR1yM=" -> null
      - id      = "hail-295901/roles/iam.serviceAccountAdmin/serviceaccount:auth-6bb9@hail-295901.iam.gserviceaccount.com" -> null
      - member  = "serviceAccount:auth-6bb9@hail-295901.iam.gserviceaccount.com" -> null
      - project = "hail-295901" -> null
      - role    = "roles/iam.serviceAccountAdmin" -> null
    }

  # google_project_iam_member.auth_service_account_key_admin will be destroyed
  - resource "google_project_iam_member" "auth_service_account_key_admin" {
      - etag    = "BwXKLgcR1yM=" -> null
      - id      = "hail-295901/roles/iam.serviceAccountKeyAdmin/serviceaccount:auth-6bb9@hail-295901.iam.gserviceaccount.com" -> null
      - member  = "serviceAccount:auth-6bb9@hail-295901.iam.gserviceaccount.com" -> null
      - project = "hail-295901" -> null
      - role    = "roles/iam.serviceAccountKeyAdmin" -> null
    }

  # google_project_iam_member.auth_storage_admin will be destroyed
  - resource "google_project_iam_member" "auth_storage_admin" {
      - etag    = "BwXKLgcR1yM=" -> null
      - id      = "hail-295901/roles/storage.admin/serviceaccount:auth-6bb9@hail-295901.iam.gserviceaccount.com" -> null
      - member  = "serviceAccount:auth-6bb9@hail-295901.iam.gserviceaccount.com" -> null
      - project = "hail-295901" -> null
      - role    = "roles/storage.admin" -> null
    }

  # google_project_iam_member.batch_agent_compute_instance_admin will be destroyed
  - resource "google_project_iam_member" "batch_agent_compute_instance_admin" {
      - etag    = "BwXKLgcR1yM=" -> null
      - id      = "hail-295901/roles/compute.instanceAdmin.v1/serviceaccount:batch2-agent@hail-295901.iam.gserviceaccount.com" -> null
      - member  = "serviceAccount:batch2-agent@hail-295901.iam.gserviceaccount.com" -> null
      - project = "hail-295901" -> null
      - role    = "roles/compute.instanceAdmin.v1" -> null
    }

  # google_project_iam_member.batch_agent_iam_member["compute.instanceAdmin.v1"] will be created
  + resource "google_project_iam_member" "batch_agent_iam_member" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = "serviceAccount:batch2-agent@hail-295901.iam.gserviceaccount.com"
      + project = (known after apply)
      + role    = "roles/compute.instanceAdmin.v1"
    }

  # google_project_iam_member.batch_agent_iam_member["iam.serviceAccountUser"] will be created
  + resource "google_project_iam_member" "batch_agent_iam_member" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = "serviceAccount:batch2-agent@hail-295901.iam.gserviceaccount.com"
      + project = (known after apply)
      + role    = "roles/iam.serviceAccountUser"
    }

  # google_project_iam_member.batch_agent_iam_member["logging.logWriter"] will be created
  + resource "google_project_iam_member" "batch_agent_iam_member" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = "serviceAccount:batch2-agent@hail-295901.iam.gserviceaccount.com"
      + project = (known after apply)
      + role    = "roles/logging.logWriter"
    }

  # google_project_iam_member.batch_agent_iam_member["storage.objectCreator"] will be created
  + resource "google_project_iam_member" "batch_agent_iam_member" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = "serviceAccount:batch2-agent@hail-295901.iam.gserviceaccount.com"
      + project = (known after apply)
      + role    = "roles/storage.objectCreator"
    }

  # google_project_iam_member.batch_agent_iam_member["storage.objectViewer"] will be created
  + resource "google_project_iam_member" "batch_agent_iam_member" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = "serviceAccount:batch2-agent@hail-295901.iam.gserviceaccount.com"
      + project = (known after apply)
      + role    = "roles/storage.objectViewer"
    }

  # google_project_iam_member.batch_agent_log_writer will be destroyed
  - resource "google_project_iam_member" "batch_agent_log_writer" {
      - etag    = "BwXKLgcR1yM=" -> null
      - id      = "hail-295901/roles/logging.logWriter/serviceaccount:batch2-agent@hail-295901.iam.gserviceaccount.com" -> null
      - member  = "serviceAccount:batch2-agent@hail-295901.iam.gserviceaccount.com" -> null
      - project = "hail-295901" -> null
      - role    = "roles/logging.logWriter" -> null
    }

  # google_project_iam_member.batch_agent_object_creator will be destroyed
  - resource "google_project_iam_member" "batch_agent_object_creator" {
      - etag    = "BwXKLgcR1yM=" -> null
      - id      = "hail-295901/roles/storage.objectCreator/serviceaccount:batch2-agent@hail-295901.iam.gserviceaccount.com" -> null
      - member  = "serviceAccount:batch2-agent@hail-295901.iam.gserviceaccount.com" -> null
      - project = "hail-295901" -> null
      - role    = "roles/storage.objectCreator" -> null
    }

  # google_project_iam_member.batch_agent_object_viewer will be destroyed
  - resource "google_project_iam_member" "batch_agent_object_viewer" {
      - etag    = "BwXKLgcR1yM=" -> null
      - id      = "hail-295901/roles/storage.objectViewer/serviceaccount:batch2-agent@hail-295901.iam.gserviceaccount.com" -> null
      - member  = "serviceAccount:batch2-agent@hail-295901.iam.gserviceaccount.com" -> null
      - project = "hail-295901" -> null
      - role    = "roles/storage.objectViewer" -> null
    }

  # google_project_iam_member.batch_agent_service_account_user will be destroyed
  - resource "google_project_iam_member" "batch_agent_service_account_user" {
      - etag    = "BwXKLgcR1yM=" -> null
      - id      = "hail-295901/roles/iam.serviceAccountUser/serviceaccount:batch2-agent@hail-295901.iam.gserviceaccount.com" -> null
      - member  = "serviceAccount:batch2-agent@hail-295901.iam.gserviceaccount.com" -> null
      - project = "hail-295901" -> null
      - role    = "roles/iam.serviceAccountUser" -> null
    }

  # google_project_iam_member.batch_compute_instance_admin will be destroyed
  - resource "google_project_iam_member" "batch_compute_instance_admin" {
      - etag    = "BwXKLgcR1yM=" -> null
      - id      = "hail-295901/roles/compute.instanceAdmin.v1/serviceaccount:batch-4238@hail-295901.iam.gserviceaccount.com" -> null
      - member  = "serviceAccount:batch-4238@hail-295901.iam.gserviceaccount.com" -> null
      - project = "hail-295901" -> null
      - role    = "roles/compute.instanceAdmin.v1" -> null
    }

  # google_project_iam_member.batch_logging_viewer will be destroyed
  - resource "google_project_iam_member" "batch_logging_viewer" {
      - etag    = "BwXKLgcR1yM=" -> null
      - id      = "hail-295901/roles/logging.viewer/serviceaccount:batch-4238@hail-295901.iam.gserviceaccount.com" -> null
      - member  = "serviceAccount:batch-4238@hail-295901.iam.gserviceaccount.com" -> null
      - project = "hail-295901" -> null
      - role    = "roles/logging.viewer" -> null
    }

  # google_project_iam_member.batch_service_account_user will be destroyed
  - resource "google_project_iam_member" "batch_service_account_user" {
      - etag    = "BwXKLgcR1yM=" -> null
      - id      = "hail-295901/roles/iam.serviceAccountUser/serviceaccount:batch-4238@hail-295901.iam.gserviceaccount.com" -> null
      - member  = "serviceAccount:batch-4238@hail-295901.iam.gserviceaccount.com" -> null
      - project = "hail-295901" -> null
      - role    = "roles/iam.serviceAccountUser" -> null
    }

  # google_project_iam_member.batch_storage_admin will be destroyed
  - resource "google_project_iam_member" "batch_storage_admin" {
      - etag    = "BwXKLgcR1yM=" -> null
      - id      = "hail-295901/roles/storage.admin/serviceaccount:batch-4238@hail-295901.iam.gserviceaccount.com" -> null
      - member  = "serviceAccount:batch-4238@hail-295901.iam.gserviceaccount.com" -> null
      - project = "hail-295901" -> null
      - role    = "roles/storage.admin" -> null
    }

  # google_project_iam_member.test_compute_instance_admin will be destroyed
  - resource "google_project_iam_member" "test_compute_instance_admin" {
      - etag    = "BwXKLgcR1yM=" -> null
      - id      = "hail-295901/roles/compute.instanceAdmin.v1/serviceaccount:test-e454@hail-295901.iam.gserviceaccount.com" -> null
      - member  = "serviceAccount:test-e454@hail-295901.iam.gserviceaccount.com" -> null
      - project = "hail-295901" -> null
      - role    = "roles/compute.instanceAdmin.v1" -> null
    }

  # google_project_iam_member.test_logging_viewer will be destroyed
  - resource "google_project_iam_member" "test_logging_viewer" {
      - etag    = "BwXKLgcR1yM=" -> null
      - id      = "hail-295901/roles/logging.viewer/serviceaccount:test-e454@hail-295901.iam.gserviceaccount.com" -> null
      - member  = "serviceAccount:test-e454@hail-295901.iam.gserviceaccount.com" -> null
      - project = "hail-295901" -> null
      - role    = "roles/logging.viewer" -> null
    }

  # google_project_iam_member.test_service_account_user will be destroyed
  - resource "google_project_iam_member" "test_service_account_user" {
      - etag    = "BwXKLgcR1yM=" -> null
      - id      = "hail-295901/roles/iam.serviceAccountUser/serviceaccount:test-e454@hail-295901.iam.gserviceaccount.com" -> null
      - member  = "serviceAccount:test-e454@hail-295901.iam.gserviceaccount.com" -> null
      - project = "hail-295901" -> null
      - role    = "roles/iam.serviceAccountUser" -> null
    }

  # google_project_iam_member.test_service_usage_consumer will be destroyed
  - resource "google_project_iam_member" "test_service_usage_consumer" {
      - etag    = "BwXKLgcR1yM=" -> null
      - id      = "hail-295901/roles/serviceusage.serviceUsageConsumer/serviceaccount:test-e454@hail-295901.iam.gserviceaccount.com" -> null
      - member  = "serviceAccount:test-e454@hail-295901.iam.gserviceaccount.com" -> null
      - project = "hail-295901" -> null
      - role    = "roles/serviceusage.serviceUsageConsumer" -> null
    }

  # google_service_account.atgu will be destroyed
  - resource "google_service_account" "atgu" {
      - account_id = "atgu-2e04" -> null
      - email      = "atgu-2e04@hail-295901.iam.gserviceaccount.com" -> null
      - id         = "projects/hail-295901/serviceAccounts/atgu-2e04@hail-295901.iam.gserviceaccount.com" -> null
      - name       = "projects/hail-295901/serviceAccounts/atgu-2e04@hail-295901.iam.gserviceaccount.com" -> null
      - project    = "hail-295901" -> null
      - unique_id  = "116302908023137750810" -> null
    }

  # google_service_account.auth will be destroyed
  - resource "google_service_account" "auth" {
      - account_id = "auth-6bb9" -> null
      - email      = "auth-6bb9@hail-295901.iam.gserviceaccount.com" -> null
      - id         = "projects/hail-295901/serviceAccounts/auth-6bb9@hail-295901.iam.gserviceaccount.com" -> null
      - name       = "projects/hail-295901/serviceAccounts/auth-6bb9@hail-295901.iam.gserviceaccount.com" -> null
      - project    = "hail-295901" -> null
      - unique_id  = "100865487932926878476" -> null
    }

  # google_service_account.batch will be destroyed
  - resource "google_service_account" "batch" {
      - account_id = "batch-4238" -> null
      - email      = "batch-4238@hail-295901.iam.gserviceaccount.com" -> null
      - id         = "projects/hail-295901/serviceAccounts/batch-4238@hail-295901.iam.gserviceaccount.com" -> null
      - name       = "projects/hail-295901/serviceAccounts/batch-4238@hail-295901.iam.gserviceaccount.com" -> null
      - project    = "hail-295901" -> null
      - unique_id  = "112461654012410736186" -> null
    }

  # google_service_account.benchmark will be destroyed
  - resource "google_service_account" "benchmark" {
      - account_id = "benchmark" -> null
      - email      = "benchmark@hail-295901.iam.gserviceaccount.com" -> null
      - id         = "projects/hail-295901/serviceAccounts/benchmark@hail-295901.iam.gserviceaccount.com" -> null
      - name       = "projects/hail-295901/serviceAccounts/benchmark@hail-295901.iam.gserviceaccount.com" -> null
      - project    = "hail-295901" -> null
      - unique_id  = "104450808460511039069" -> null
    }

  # google_service_account.ci will be destroyed
  - resource "google_service_account" "ci" {
      - account_id = "ci-c1d4" -> null
      - email      = "ci-c1d4@hail-295901.iam.gserviceaccount.com" -> null
      - id         = "projects/hail-295901/serviceAccounts/ci-c1d4@hail-295901.iam.gserviceaccount.com" -> null
      - name       = "projects/hail-295901/serviceAccounts/ci-c1d4@hail-295901.iam.gserviceaccount.com" -> null
      - project    = "hail-295901" -> null
      - unique_id  = "116935826037003095759" -> null
    }

  # google_service_account.monitoring will be destroyed
  - resource "google_service_account" "monitoring" {
      - account_id = "monitoring" -> null
      - email      = "monitoring@hail-295901.iam.gserviceaccount.com" -> null
      - id         = "projects/hail-295901/serviceAccounts/monitoring@hail-295901.iam.gserviceaccount.com" -> null
      - name       = "projects/hail-295901/serviceAccounts/monitoring@hail-295901.iam.gserviceaccount.com" -> null
      - project    = "hail-295901" -> null
      - unique_id  = "107771434575075480596" -> null
    }

  # google_service_account.query will be destroyed
  - resource "google_service_account" "query" {
      - account_id = "query-fdb4" -> null
      - email      = "query-fdb4@hail-295901.iam.gserviceaccount.com" -> null
      - id         = "projects/hail-295901/serviceAccounts/query-fdb4@hail-295901.iam.gserviceaccount.com" -> null
      - name       = "projects/hail-295901/serviceAccounts/query-fdb4@hail-295901.iam.gserviceaccount.com" -> null
      - project    = "hail-295901" -> null
      - unique_id  = "104302061049254445224" -> null
    }

  # google_service_account.test will be destroyed
  - resource "google_service_account" "test" {
      - account_id = "test-e454" -> null
      - email      = "test-e454@hail-295901.iam.gserviceaccount.com" -> null
      - id         = "projects/hail-295901/serviceAccounts/test-e454@hail-295901.iam.gserviceaccount.com" -> null
      - name       = "projects/hail-295901/serviceAccounts/test-e454@hail-295901.iam.gserviceaccount.com" -> null
      - project    = "hail-295901" -> null
      - unique_id  = "116112914384896224138" -> null
    }

  # google_service_account.test_dev will be destroyed
  - resource "google_service_account" "test_dev" {
      - account_id = "test-dev" -> null
      - email      = "test-dev@hail-295901.iam.gserviceaccount.com" -> null
      - id         = "projects/hail-295901/serviceAccounts/test-dev@hail-295901.iam.gserviceaccount.com" -> null
      - name       = "projects/hail-295901/serviceAccounts/test-dev@hail-295901.iam.gserviceaccount.com" -> null
      - project    = "hail-295901" -> null
      - unique_id  = "110349480392048474363" -> null
    }

  # google_service_account_key.atgu_key will be destroyed
  - resource "google_service_account_key" "atgu_key" {
      - id                 = "projects/hail-295901/serviceAccounts/atgu-2e04@hail-295901.iam.gserviceaccount.com/keys/ce32e085d6d25c5f873954440fffc640705f33a4" -> null
      - key_algorithm      = "KEY_ALG_RSA_2048" -> null
      - name               = "projects/hail-295901/serviceAccounts/atgu-2e04@hail-295901.iam.gserviceaccount.com/keys/ce32e085d6d25c5f873954440fffc640705f33a4" -> null
      - private_key        = (sensitive value)
      - private_key_type   = "TYPE_GOOGLE_CREDENTIALS_FILE" -> null
      - public_key         = "LS0tLS1CRUdJTiBDRVJUSUZJQ0FURS0tLS0tCk1JSUMvRENDQWVTZ0F3SUJBZ0lJYnBha3J4cmxLU1l3RFFZSktvWklodmNOQVFFRkJRQXdJREVlTUJ3R0ExVUUKQXhNVk1URTJNekF5T1RBNE1ESXpNVE0zTnpVd09ERXdNQ0FYRFRJd01URXlNREV3TlRBeU1Gb1lEems1T1RreApNak14TWpNMU9UVTVXakFnTVI0d0hBWURWUVFERXhVeE1UWXpNREk1TURnd01qTXhNemMzTlRBNE1UQXdnZ0VpCk1BMEdDU3FHU0liM0RRRUJBUVVBQTRJQkR3QXdnZ0VLQW9JQkFRREoxaXpvTnpYVDdxSVU3aXM5bWxiZWowdVMKZU1lM2w0UFcrVFVRMTZvVUNhV3QweFRTd2x1Um9SNmFYaGk2bVFSa3A3N2dlNDVJV1dwY3ZrZ0lDNG5nZVBLYgpWYXVmZVo2OFl3cDNsODlzb0g1clFMbTNVeXRhbU0zMXhneFJZajkwOXdyMTVObElkZGdBTHp5aWN1TSt2cGllClFLaHFwNHlrTUhoTTNzYlVMSWZoNGEzNm1ZQkFDOC9SMTM5SzBtVXcwYmRHdjRZYjNveWY3WkhoNGx6YVJ5cWYKclF2dFJpRTZmUEpTajJYenpOVndGZ2RSb1BBNytueVUrY1JDSjQ4RitEVGN4TW9nUzZFVmxDakd6bHI4dGVkcQpXV3J6R29WVlBkRXBmZ2ppRkcydDI2WUhNZE5Bdzh3S1kzR3ZvL3hKMmpLVFFhTnBRSzZUcllGYk9QeTNBZ01CCkFBR2pPREEyTUF3R0ExVWRFd0VCL3dRQ01BQXdEZ1lEVlIwUEFRSC9CQVFEQWdlQU1CWUdBMVVkSlFFQi93UU0KTUFvR0NDc0dBUVVGQndNQ01BMEdDU3FHU0liM0RRRUJCUVVBQTRJQkFRQVVkdC9NUGZwU2pZUU9UWTBGMmtsSApMRWxOWVFUWjlFWEpvRlhVWE1sYlNwam9kNWY2VW4vcENRYWJaZEM4dVVjdjM3YlFYeGFKYnFSUmt6Qzk1YVI3CkRlckVPVmUxS1kvQ051TnBCQTIwNG9kanE3NG01eFF6eU5lUnozdnNWcFJIV0FiQi9xUHdHS0hTMTBOa0lJRVIKWE82Y2tQbk10OUtpWURPUy9aZGpSckxrNXg2N1FlOGVYUjFYVWNWWFRUbFExdldYenRuc3g0Z3lsYXlCNUV5cQpVNm9XS2J5QUtCZGo4cGxySWhMWW0zeVk1U1lreGdQQVk1Mm0rbUtTcHZGekxxR1NSdjlCOFBrWkZ6NkdCbDB5Ckp3eXJmQ3ZhbjJ5aHh1SDRWSzNFVXRBUU0wUVdxZm5Kd2xqYkV4bkl2QjdLelZlenAvUUdzS0N5c09oRkFsZ0wKLS0tLS1FTkQgQ0VSVElGSUNBVEUtLS0tLQo=" -> null
      - public_key_type    = "TYPE_X509_PEM_FILE" -> null
      - service_account_id = "projects/hail-295901/serviceAccounts/atgu-2e04@hail-295901.iam.gserviceaccount.com" -> null
      - valid_after        = "2020-11-20T10:50:20Z" -> null
      - valid_before       = "9999-12-31T23:59:59Z" -> null
    }

  # google_service_account_key.auth_key will be destroyed
  - resource "google_service_account_key" "auth_key" {
      - id                 = "projects/hail-295901/serviceAccounts/auth-6bb9@hail-295901.iam.gserviceaccount.com/keys/86c544a79a820d504ed31dc0fab431eb79079aac" -> null
      - key_algorithm      = "KEY_ALG_RSA_2048" -> null
      - name               = "projects/hail-295901/serviceAccounts/auth-6bb9@hail-295901.iam.gserviceaccount.com/keys/86c544a79a820d504ed31dc0fab431eb79079aac" -> null
      - private_key        = (sensitive value)
      - private_key_type   = "TYPE_GOOGLE_CREDENTIALS_FILE" -> null
      - public_key         = "LS0tLS1CRUdJTiBDRVJUSUZJQ0FURS0tLS0tCk1JSUMvRENDQWVTZ0F3SUJBZ0lJVUhIUEJuWWQzajB3RFFZSktvWklodmNOQVFFRkJRQXdJREVlTUJ3R0ExVUUKQXhNVk1UQXdPRFkxTkRnM09UTXlPVEkyT0RjNE5EYzJNQ0FYRFRJd01URXlNREV3TlRBeE1Wb1lEems1T1RreApNak14TWpNMU9UVTVXakFnTVI0d0hBWURWUVFERXhVeE1EQTROalUwT0RjNU16STVNalk0TnpnME56WXdnZ0VpCk1BMEdDU3FHU0liM0RRRUJBUVVBQTRJQkR3QXdnZ0VLQW9JQkFRQ3ZtSDRiRGRIMG4vR3VEZ2hlaTA4OG5RRzUKSG1qU0N0R2M0Ymp0UmErWGx6TXRLbzc2Uitqa2Fza3FFMFE5T0p5Z3lGdWRDcWFtN29XaEgyakVta0QzcTVTMgpJQSsxVnk4eERnVlRXcFMrVG5QZ1podnVoRUp5Z2ZvZHNVQ1p6aVp2UGVsMmd1b284bm83bkg0R3RpaUZsQXA5CkNXM04vYWNtLzRFTXBLMmgyMytGakdqbWxVR3dDRXlGc3Q5QVFsNkkwOVRHNHpZSXc0OWR0OHNiNW1pN3I0RDUKUldVZGdvaWpoVXoxV002NzJKRWVqYjhCRXVMU2VjTGIxUWFoand5cStzY3VXaEpaYXBmSG5JSnlHWUw4ZWRFMgpUdzdCc3JFVmVvNmxyamROQkVHVld4WG9hMVZBOWFrWm8vVk5XMzFXUG9ueGh1RGFkd0FvMm9vckFYUTVBZ01CCkFBR2pPREEyTUF3R0ExVWRFd0VCL3dRQ01BQXdEZ1lEVlIwUEFRSC9CQVFEQWdlQU1CWUdBMVVkSlFFQi93UU0KTUFvR0NDc0dBUVVGQndNQ01BMEdDU3FHU0liM0RRRUJCUVVBQTRJQkFRQWo3aThOa1N2dkM5SWplb3dCM3JnWgpncUJrN1paTGJDS0YzeERIK0JMM3ROd2pSYkJYS2RidWFhSHdseWhvZXloYkRCRXZEUTBKeFhQVjluc1U5REI0CmVjcFBlNEVTRWFOQkRwa1FWblhoaGdCNVZpTXVMZHFTWHdra1FDOFE0aFJIcnBuU1cxbTc4VTFSR3hGV2JrdTgKa2pOUUJNMEd3TnhyUlJHcENOd1ZJT0I4aVZ5blJiZnNCUkIyZDBTc0VSWkc5ck5jZUFhQjBib3gvWXROVG5JQQp6WG90QVIwWktsYWN6eTNTbTRBYklZMHV1TG1kdDEyaEZESFJhOUJ3ekI4WTVzUXF6dWxwdGtibXJlTDJVSmFwCmdEenBsR2xMNHNocUVMOWoyYTB0bkJ1OXpabXM1MEpGME5XTDMzUGc2V2RVZEdmTWYwSk16T2lPbC9CU2ZUd0oKLS0tLS1FTkQgQ0VSVElGSUNBVEUtLS0tLQo=" -> null
      - public_key_type    = "TYPE_X509_PEM_FILE" -> null
      - service_account_id = "projects/hail-295901/serviceAccounts/auth-6bb9@hail-295901.iam.gserviceaccount.com" -> null
      - valid_after        = "2020-11-20T10:50:11Z" -> null
      - valid_before       = "9999-12-31T23:59:59Z" -> null
    }

  # google_service_account_key.batch_key will be destroyed
  - resource "google_service_account_key" "batch_key" {
      - id                 = "projects/hail-295901/serviceAccounts/batch-4238@hail-295901.iam.gserviceaccount.com/keys/6e1dcc337440e3da9d85b728752934d8e4a446df" -> null
      - key_algorithm      = "KEY_ALG_RSA_2048" -> null
      - name               = "projects/hail-295901/serviceAccounts/batch-4238@hail-295901.iam.gserviceaccount.com/keys/6e1dcc337440e3da9d85b728752934d8e4a446df" -> null
      - private_key        = (sensitive value)
      - private_key_type   = "TYPE_GOOGLE_CREDENTIALS_FILE" -> null
      - public_key         = "LS0tLS1CRUdJTiBDRVJUSUZJQ0FURS0tLS0tCk1JSUMvRENDQWVTZ0F3SUJBZ0lJZmRDOFhQbk8vdzB3RFFZSktvWklodmNOQVFFRkJRQXdJREVlTUJ3R0ExVUUKQXhNVk1URXlORFl4TmpVME1ERXlOREV3TnpNMk1UZzJNQ0FYRFRJd01URXlNREV3TlRBd09Wb1lEems1T1RreApNak14TWpNMU9UVTVXakFnTVI0d0hBWURWUVFERXhVeE1USTBOakUyTlRRd01USTBNVEEzTXpZeE9EWXdnZ0VpCk1BMEdDU3FHU0liM0RRRUJBUVVBQTRJQkR3QXdnZ0VLQW9JQkFRRGNVQlZHa2E4cnBRVXhiaUtLN3R0RVQ5d0oKRGk2TlZpdVdqWU4rMmZ4NnorcTFGZTNwTnV1ZVRZVEx6Um1JSVVkeDV2Z1grOHArakhTZWRoWk9XS0VlZmVOSwpoaWs4SGZDdEFUUWMrOXo4YXpSby9YKzdWVE1JVU9YNlRZTHBQK2o3citMUi8yaGxqTk9hMVpCdlRRUlFsNHB4CkpWdDlmdE81dzhGdFBPclVGUEU1ejJNZVU5dk03andweVJQc2NmMTg4aXZDckg4UTI4bVNYbjVMN0dzRC8rZ0YKdGgzK2xBMUpOQlp1UDV3aVIxa3BNbDNWSnI0bjFOamZGd3MyVkVzZXJrMnJsZ25YRXR0WTBmKyszWnhxZWhEaQpONXZLVlE5d0k0RnBWcXRHQnIxMW5qT3Z5VGg5b3dsWWh4QzQ2d1hUTnltSW5ZL1I2cnBNaDhOanpreWxBZ01CCkFBR2pPREEyTUF3R0ExVWRFd0VCL3dRQ01BQXdEZ1lEVlIwUEFRSC9CQVFEQWdlQU1CWUdBMVVkSlFFQi93UU0KTUFvR0NDc0dBUVVGQndNQ01BMEdDU3FHU0liM0RRRUJCUVVBQTRJQkFRQ1Q3YW1UOXlRRDFJazQ3VlRmUUhGRAo2SW9NSUpKRE01SDBpVzk5dVQwK2RPeENGRVhOUXNOeEFXbDdsSVNoSXZsRzg1dG05Ti95Mmx5K2hVbzJSWUVqCkF2NEszdTMxV2gvdFlxRDE1eTltM1BlRklLODJKQ0tyNktCSlN2bVdja1RsY3F3UUthcWhvM2ZEWGQvK1NBdC8KU1UvK1lDZnVkVzZFaWNrQWJuZlBnT25VZnladkRMdFgzZ2t4VUExaXVsSW01dFJSam9sQTh3R21IY3Z2aThKVgowWlhEdmFrYTVyYjZPdC9ZWWhmM00rUTFqRnVSbVdBaVBWeGxoVTlTR0ZjM1NlanU1VC9xNEJtcy8zTEtQM0RrCi9NQU9aa2xaOXhtcUQ5WDZxWlNmRDZhWHpJb3dhcEF5SXcyeW1Va1BvWGd0TVZNcDIycUp0NC9ha0FQZU1OT2IKLS0tLS1FTkQgQ0VSVElGSUNBVEUtLS0tLQo=" -> null
      - public_key_type    = "TYPE_X509_PEM_FILE" -> null
      - service_account_id = "projects/hail-295901/serviceAccounts/batch-4238@hail-295901.iam.gserviceaccount.com" -> null
      - valid_after        = "2020-11-20T10:50:09Z" -> null
      - valid_before       = "9999-12-31T23:59:59Z" -> null
    }

  # google_service_account_key.benchmark_key will be destroyed
  - resource "google_service_account_key" "benchmark_key" {
      - id                 = "projects/hail-295901/serviceAccounts/benchmark@hail-295901.iam.gserviceaccount.com/keys/d9c6e792b301c5e0afb0158173d90fc95509c12a" -> null
      - key_algorithm      = "KEY_ALG_RSA_2048" -> null
      - name               = "projects/hail-295901/serviceAccounts/benchmark@hail-295901.iam.gserviceaccount.com/keys/d9c6e792b301c5e0afb0158173d90fc95509c12a" -> null
      - private_key        = (sensitive value)
      - private_key_type   = "TYPE_GOOGLE_CREDENTIALS_FILE" -> null
      - public_key         = "LS0tLS1CRUdJTiBDRVJUSUZJQ0FURS0tLS0tCk1JSUMvRENDQWVTZ0F3SUJBZ0lJZGNCZUxmNloya2d3RFFZSktvWklodmNOQVFFRkJRQXdJREVlTUJ3R0ExVUUKQXhNVk1UQTBORFV3T0RBNE5EWXdOVEV4TURNNU1EWTVNQ0FYRFRJd01URXlNREV3TlRBeE5sb1lEems1T1RreApNak14TWpNMU9UVTVXakFnTVI0d0hBWURWUVFERXhVeE1EUTBOVEE0TURnME5qQTFNVEV3TXprd05qa3dnZ0VpCk1BMEdDU3FHU0liM0RRRUJBUVVBQTRJQkR3QXdnZ0VLQW9JQkFRQ21Lcm5HTmx2K0ZsdW4rVjMyTEh6QVdaRzEKemZPTHVvZmhFMmpPMnA5Qjl0ZnRCbUhWenpsS2RhQ0xUaUkvOTFiY0cyb2VJcnZyOFJDWVIzUnhEeDFuNllBZwpvVGREbSsvQmJtRUlVeXJhYmlFQkpjczlzRmpzelEzT3kwSjY1c1F1RUlaTFJwL1ZwNGZZMDRHY1NQd1FLckN0CmtHeUd4QXUyQUx2RGYzRDhyb21abnQ0TXBFNUdXbWdRR0p1ekRBQlhqd1JmSDNhdldMcjFIUnoySEE2NzA1dzkKclFLVGtiWjNnNjV3WmhTTHIzL3l1bnF1bUpkdWVRaU9xM2JsU2loek81NVc4dFJWRlQwZUtnNzcwRG5IZFVsNQpDb0ppS3YyMi9mbWp1cElQS0ZiRUN4eEFsM1dCcmhqNnVZSEFKK1g0THVlYTFRY0ZoM1c3YllveGd6SHZBZ01CCkFBR2pPREEyTUF3R0ExVWRFd0VCL3dRQ01BQXdEZ1lEVlIwUEFRSC9CQVFEQWdlQU1CWUdBMVVkSlFFQi93UU0KTUFvR0NDc0dBUVVGQndNQ01BMEdDU3FHU0liM0RRRUJCUVVBQTRJQkFRQmQ1YnVCbFNuT1A0Qkd2QldWelZZWQpjOE5VU0N0OFZ4WEtyTXhNMm4rRElqQytZQisrcnArby9GVkoxSjhaN0o2ejA3YU54bWVaN0t5Tzl4b2l4b1loCmdCQWxnS2M2SldQV3JFNEt0cCtWQzBCUlY5Ris2YjZ0cmhoa04yRGZrL2V6aWc2amZFVDNBSC9wU3N4ZmpIZE0KVStGUEhRTDhtd3Vxa2NlVTlWWVROY0dsQUh2OHphcHhMOFlXdHJGbzZRM25hdmtqMXNRbURVc251azZZSFNkRwp3Q25pSE9UUkdibmhXQ0FUaFgrMTJnWjBsZ1Y1ZU5pdkR5RWlyZWFtbEhmaUNIQTBublZrdUhDTjNMYlZ0Q3AwCi9FYzNjeTFaT0FZUEpWOFdiekhtT1dxRFRCNktxQkt4d1FwaW5tZE1RZlgyOFFXYTJMa1pCblFNZktzZFhqWVgKLS0tLS1FTkQgQ0VSVElGSUNBVEUtLS0tLQo=" -> null
      - public_key_type    = "TYPE_X509_PEM_FILE" -> null
      - service_account_id = "projects/hail-295901/serviceAccounts/benchmark@hail-295901.iam.gserviceaccount.com" -> null
      - valid_after        = "2020-11-20T10:50:16Z" -> null
      - valid_before       = "9999-12-31T23:59:59Z" -> null
    }

  # google_service_account_key.ci_key will be destroyed
  - resource "google_service_account_key" "ci_key" {
      - id                 = "projects/hail-295901/serviceAccounts/ci-c1d4@hail-295901.iam.gserviceaccount.com/keys/78bf875ade2a4e505b10918f45ea1a7ffd69f702" -> null
      - key_algorithm      = "KEY_ALG_RSA_2048" -> null
      - name               = "projects/hail-295901/serviceAccounts/ci-c1d4@hail-295901.iam.gserviceaccount.com/keys/78bf875ade2a4e505b10918f45ea1a7ffd69f702" -> null
      - private_key        = (sensitive value)
      - private_key_type   = "TYPE_GOOGLE_CREDENTIALS_FILE" -> null
      - public_key         = "LS0tLS1CRUdJTiBDRVJUSUZJQ0FURS0tLS0tCk1JSUMvRENDQWVTZ0F3SUJBZ0lJV05JYllqQXA3WFl3RFFZSktvWklodmNOQVFFRkJRQXdJREVlTUJ3R0ExVUUKQXhNVk1URTJPVE0xT0RJMk1ETTNNREF6TURrMU56VTVNQ0FYRFRJd01URXlOREl4TkRnME1Wb1lEems1T1RreApNak14TWpNMU9UVTVXakFnTVI0d0hBWURWUVFERXhVeE1UWTVNelU0TWpZd016Y3dNRE13T1RVM05Ua3dnZ0VpCk1BMEdDU3FHU0liM0RRRUJBUVVBQTRJQkR3QXdnZ0VLQW9JQkFRQ04vY01Nck81cmZTRW41MzkyRzlZYlpPa28KZTlnVVdNT3lpaXNucnVzNWY5YkFoRTAvUE5lZW5tTEtPVkh0Z3dHaUdrNVFEa3JyUDZwc081Y2Zndmgrczl2dQpUUDBCLzViUFF2ZEpUNjM1NFNVTUZ5YzZBci80Vmw3RkVHd0RKSGVTY3RDMnRCdERiSmIxa2dmSnlYUGd2cTQ3CmZVV2lhWWpnU1QrMnl5WjZlZVE1YU5QZVJpQkZXQ0kxa3h1UEx5enJkQ0N0RDR4TDc5V1ZxVUxkNXIvUXJBT28KbGhocVVsNGh3N2g2QVZpUGJvOEtDUkpuRmp4dUpmaS9jbU8yQ0ZxOEo1YTRXY292SlFwSW9kM3JHbjZQdkkzNAptK0NBcWpGSDkrTzRSOFBkNkZLcGZ1bzNMVTRxb29GcGRtWkZvVWpadTk2SjNBOU5qRUZnUDRkd3dhTEJBZ01CCkFBR2pPREEyTUF3R0ExVWRFd0VCL3dRQ01BQXdEZ1lEVlIwUEFRSC9CQVFEQWdlQU1CWUdBMVVkSlFFQi93UU0KTUFvR0NDc0dBUVVGQndNQ01BMEdDU3FHU0liM0RRRUJCUVVBQTRJQkFRQnpXWjlyeCt2dks3aE5OTDIxUVJlbwpqMUpCNllXLzF1bjFJVHFKa1pJa0I1aThJTmxCdjBWSlBTQkRPQjlVZ25wYjBxODMwQ0ZhRXRZQkE2NW5uT1VUCnZIRXJQQkVjZ3JFbnFqTERQN2Q4bVlaR1Z2bDBFNHY5SFdoYUtXdG5GNGNXMldVZzE5SUNKeGtHVEFWNk5CWGwKVEp1MzVsNzVxblNLMmRmSGdrWE9QZVZFRm5EcHRWbXlqUU5idzdlSU9xbWFpOVNTZGl1dHpoRE9BcHRhSStHMwptbnAxaEwxWmx0Y0hQOWtna0Z0dUtKeURaV2I0akliZW5XVnNXbjUxNU11Zk9GL294MGRvRGpvc295WUkvNmJFCkx6R0NuTUFwcVRwYkhZY3JBVU55U1huWGRpTVB1aGp1RVkyRmFHT1dlWEMzeFlvZzhOOVcvVUpRNjFHWFhNV2kKLS0tLS1FTkQgQ0VSVElGSUNBVEUtLS0tLQo=" -> null
      - public_key_type    = "TYPE_X509_PEM_FILE" -> null
      - service_account_id = "projects/hail-295901/serviceAccounts/ci-c1d4@hail-295901.iam.gserviceaccount.com" -> null
      - valid_after        = "2020-11-24T21:48:41Z" -> null
      - valid_before       = "9999-12-31T23:59:59Z" -> null
    }

  # google_service_account_key.monitoring_key will be destroyed
  - resource "google_service_account_key" "monitoring_key" {
      - id                 = "projects/hail-295901/serviceAccounts/monitoring@hail-295901.iam.gserviceaccount.com/keys/adde19974628fff371be300186eab21d50645f95" -> null
      - key_algorithm      = "KEY_ALG_RSA_2048" -> null
      - name               = "projects/hail-295901/serviceAccounts/monitoring@hail-295901.iam.gserviceaccount.com/keys/adde19974628fff371be300186eab21d50645f95" -> null
      - private_key        = (sensitive value)
      - private_key_type   = "TYPE_GOOGLE_CREDENTIALS_FILE" -> null
      - public_key         = "LS0tLS1CRUdJTiBDRVJUSUZJQ0FURS0tLS0tCk1JSUMvRENDQWVTZ0F3SUJBZ0lJSURaTGMraEZNV2d3RFFZSktvWklodmNOQVFFRkJRQXdJREVlTUJ3R0ExVUUKQXhNVk1UQTNOemN4TkRNME5UYzFNRGMxTkRnd05UazJNQ0FYRFRJd01URXlNREV3TlRBd09Wb1lEems1T1RreApNak14TWpNMU9UVTVXakFnTVI0d0hBWURWUVFERXhVeE1EYzNOekUwTXpRMU56VXdOelUwT0RBMU9UWXdnZ0VpCk1BMEdDU3FHU0liM0RRRUJBUVVBQTRJQkR3QXdnZ0VLQW9JQkFRRFNTa2RQOEs0MXlJcXFJZCtvdnQ2VUk5bmoKS3V6MEJQazRaUC8yUUtCVS9aR3BLNHc5VlV6QmxURHJQNmU2S3lBbytmUmY4a0JBZ2tYTlRKUmxjVWpLKzZnaQpNMGtRTFg3RGs5dUptaXVkc2lWOGVVcDNnNEZmM210YWhYUUFia2wxcVRlSnVDbGVpOUUvYXY3TGNSWnlZUGsvCmc3SmVKOEJQRHBLNmF0RkFwb1BQSUppRnFMSnBzRXRYTGY1dEYvMHZzU25jaWFnWk1ZUWRiWkFaanVYNGdYRkQKb0plTHFlVmFWclNLdmhpakFvOWU3SDU1TDhqWjlEeXZLWmcwTGkxTmlpNXNlU3dwZ3JHOTVQNkR4TGd1R01lYgpvV3l3SDYvR21qWmcxSUZTMjk5cjdoNmdoVWpNamwySGY3c0czMmx1WDd6Sy9GR3UyMXNQNDFDSHYxTHZBZ01CCkFBR2pPREEyTUF3R0ExVWRFd0VCL3dRQ01BQXdEZ1lEVlIwUEFRSC9CQVFEQWdlQU1CWUdBMVVkSlFFQi93UU0KTUFvR0NDc0dBUVVGQndNQ01BMEdDU3FHU0liM0RRRUJCUVVBQTRJQkFRQ0IrVGd3ZzdGcjJHd2RhN1FLSU9VWApNUVZoZTlYMy9SSnZoUkpUaEhrMzQ3bnFaNzhKeFZNYVFuSGJpdXg1eDU4cUppdkNIK2VjKzYrVGFtd0xObjZwCmQvR3VZQ1ZaQVBhK0twVHJQbDhXREU3M0RCY1cwWmJjOUxZeEpsZ2N6MFVJVER6WnU0c3UvTCtRU2t1UGlHQmsKYStwT0xoaW9aNVFOZzhMKzFTay9XKzhHSkl3ZXAzQ2NxaElGWDlpZloyaXozYUNZVGRxczIwWklpcUEvNG44VQpxM0J4TkxNdlhVNDlBdzdYWkUwUXY0d2sxK3dzZ1FYYmVGNy90WHVTVmxmK1ZqcnlraDJEczFSMTRrY3ZiSDJaCkZPRk1VcDF3V20xVUNIODBRVnYyTkdCcGltUXc3ZzRGRk1kd0ZLeGY2WVlQVk05M3d1RVJxdGFyNTdNalg4VHcKLS0tLS1FTkQgQ0VSVElGSUNBVEUtLS0tLQo=" -> null
      - public_key_type    = "TYPE_X509_PEM_FILE" -> null
      - service_account_id = "projects/hail-295901/serviceAccounts/monitoring@hail-295901.iam.gserviceaccount.com" -> null
      - valid_after        = "2020-11-20T10:50:09Z" -> null
      - valid_before       = "9999-12-31T23:59:59Z" -> null
    }

  # google_service_account_key.query_key will be destroyed
  - resource "google_service_account_key" "query_key" {
      - id                 = "projects/hail-295901/serviceAccounts/query-fdb4@hail-295901.iam.gserviceaccount.com/keys/7c10b622b4182d3a8181f140a33e3195d1c78a47" -> null
      - key_algorithm      = "KEY_ALG_RSA_2048" -> null
      - name               = "projects/hail-295901/serviceAccounts/query-fdb4@hail-295901.iam.gserviceaccount.com/keys/7c10b622b4182d3a8181f140a33e3195d1c78a47" -> null
      - private_key        = (sensitive value)
      - private_key_type   = "TYPE_GOOGLE_CREDENTIALS_FILE" -> null
      - public_key         = "LS0tLS1CRUdJTiBDRVJUSUZJQ0FURS0tLS0tCk1JSUMvRENDQWVTZ0F3SUJBZ0lJS1ZmcHYrbTk1K3N3RFFZSktvWklodmNOQVFFRkJRQXdJREVlTUJ3R0ExVUUKQXhNVk1UQTBNekF5TURZeE1EUTVNalUwTkRRMU1qSTBNQ0FYRFRJeE1EUXdOakF4TlRRME9Wb1lEems1T1RreApNak14TWpNMU9UVTVXakFnTVI0d0hBWURWUVFERXhVeE1EUXpNREl3TmpFd05Ea3lOVFEwTkRVeU1qUXdnZ0VpCk1BMEdDU3FHU0liM0RRRUJBUVVBQTRJQkR3QXdnZ0VLQW9JQkFRQ3dvSVVYemVEb2hJZWxGWjZyZU5NbW5XVEkKNDRYUldESkRPL0l6Qm1nWGFJL3kxS3BrZFRHNVp2b2RBNlRCWFFicUNqM3c2ZllrRk1mbloxTVJMY1VOK2lIcQo3aVg3czJqd05RbG93a04zeXF2WDRQZVFrc1c2bW9TOHJmbXhBNUpqQnFkeVFHUk5LSk1tZ2k3UDFuSDBWK3d3CnMwUnAxc0ZvT0JWeFo3T0sxRlNpcXpNeUJ1S1psUlVXVmNSZnIxSStyUWpWdUlMM3BYZ0V0YVA1UHZSUW4zYmkKSm14ZjI0MlZnRVNwTGFQQUFDTlNIUzdkNW5FUzNQVEFuSDdSU0pFMko4NGwvZ1UwMVhnK1NCQUpWTk9PcFYyeQpOT2hxdnJQUzhkbnR4NElrU1hQazl4emhiN21ZOXNTS1E5N2tCdjRzdDhWQWZjRkRWTjJjd1BmZ2xLNEZBZ01CCkFBR2pPREEyTUF3R0ExVWRFd0VCL3dRQ01BQXdEZ1lEVlIwUEFRSC9CQVFEQWdlQU1CWUdBMVVkSlFFQi93UU0KTUFvR0NDc0dBUVVGQndNQ01BMEdDU3FHU0liM0RRRUJCUVVBQTRJQkFRQTJ4VDhKUjNqTzNkR0tlRmt4QVVNWAp5c3B3NXRUZmI3OGw0R1g5SktDRUhnY1E2NkRQZE1tYVJyODZkdVdqamt3WEY1N3VadTE0TDRMZVE2bDl3TklxClNmZjBXbGlqV1RTNlhHbHRNdndvUXNNVmJjc3MxN2JwQ2wwL2tiTVFqM25BOXIxVGZucVVyR3ZHNXpUUWRRL24KdmFncnZiY1B2VWVWaTZDZUFmUmdTanRHT1FSenhjcWQxNVJjelQ1b1htS0liUU12emdIc2JDb21KNzNFKzBnUQp1blFuVk9SK3dHYy91QlJzbGlFcFFWQzROUXdpWU5IcTZXNmZ2STUzVHlKVXpvU1VkaW9pM2oxaXBrOEpwamtlCnFFeW5lTnJlOUE3NFJWbU42RWpMNmN5ajBhVkd6OTdRRC9kTTFNbzVqU3NwZXNLeG4zTit5aGdTalQvNWtacmEKLS0tLS1FTkQgQ0VSVElGSUNBVEUtLS0tLQo=" -> null
      - public_key_type    = "TYPE_X509_PEM_FILE" -> null
      - service_account_id = "projects/hail-295901/serviceAccounts/query-fdb4@hail-295901.iam.gserviceaccount.com" -> null
      - valid_after        = "2021-04-06T01:54:49Z" -> null
      - valid_before       = "9999-12-31T23:59:59Z" -> null
    }

  # google_service_account_key.test_dev_key will be destroyed
  - resource "google_service_account_key" "test_dev_key" {
      - id                 = "projects/hail-295901/serviceAccounts/test-dev@hail-295901.iam.gserviceaccount.com/keys/8afee9248c1462bf13f482ebeab2ab456d18e862" -> null
      - key_algorithm      = "KEY_ALG_RSA_2048" -> null
      - name               = "projects/hail-295901/serviceAccounts/test-dev@hail-295901.iam.gserviceaccount.com/keys/8afee9248c1462bf13f482ebeab2ab456d18e862" -> null
      - private_key        = (sensitive value)
      - private_key_type   = "TYPE_GOOGLE_CREDENTIALS_FILE" -> null
      - public_key         = "LS0tLS1CRUdJTiBDRVJUSUZJQ0FURS0tLS0tCk1JSUMvRENDQWVTZ0F3SUJBZ0lJZFdTelNkWGRTUVF3RFFZSktvWklodmNOQVFFRkJRQXdJREVlTUJ3R0ExVUUKQXhNVk1URXdNelE1TkRnd016a3lNRFE0TkRjME16WXpNQ0FYRFRJd01URXlNREV3TlRBd05Wb1lEems1T1RreApNak14TWpNMU9UVTVXakFnTVI0d0hBWURWUVFERXhVeE1UQXpORGswT0RBek9USXdORGcwTnpRek5qTXdnZ0VpCk1BMEdDU3FHU0liM0RRRUJBUVVBQTRJQkR3QXdnZ0VLQW9JQkFRQ1JxMzBVVjh2VEFiZUd3MXZxa0RLYkp3SGgKdGtyTVd2RWh3THBaWmxnYi81aGdhd3VWSTBkK2h0ZmE2KytwYkVOUVZycjRtZ2w2NWpuQXg3STNWaGZ6UCs1bgpnaTJKSnZJR3B0RWJZL0xxS1BHTFA2VUJCMHh4Y2hKUVA3YVhIRTl6Y1BoMzNrTXdOb2t0Nm5WeGRJNXJybDlzCkg0MXBJZXBTbWdtOXg5V1dqRU51TFQxcW1OZDdnQ0hieG91QmZjbmZwMWZlcXV4N0svUXF5NDJaUjZBYWpnTzIKTldYYWhHSXFlKzYvbytCV245SllWWUdRUGFKSWgwVS9FOHJtV0g1S3AwM2FKVHNiZGhBcWxJN3NKRFI4VEpmdwppelJ5RHREa0x0TEV1QmpsbzVvdCt2T3J4clBLZ01BOVlGdFY4d2hpQUJnVEgwRjB1NUJsRW9KU0hxUm5BZ01CCkFBR2pPREEyTUF3R0ExVWRFd0VCL3dRQ01BQXdEZ1lEVlIwUEFRSC9CQVFEQWdlQU1CWUdBMVVkSlFFQi93UU0KTUFvR0NDc0dBUVVGQndNQ01BMEdDU3FHU0liM0RRRUJCUVVBQTRJQkFRQ04wQmVBVitQa3p4SjQvOEVPTnMrSApTbkg1Uko1TCt2L29QK1FWRm9wLzN1TXZFSzhPWmdRTnR3QnplZEZ0bVBzMDRyVVY5a0FiVDBvbnFDeE5MUVZRCmtyeGhGM1ZpQ3UxSHVPSjRVMm1YYXdSQjB4d3ZUM1ZwT3dZWGF0SExrYUgzQUFSRVNaMFFweVJhRkI5VTdaaUoKekdsZ2VJUUM4Qlc0TTJEMUgvRjl6Y3lSKzhjV3N1OVdnSnhqaEllTXZHMUc2MERUeWl6OUV4d0VmSkJWQjJ3MAo5cWxxV0IvZ3lZVDZ4bDU1eVA1RGswd2tFbEQ4VVAxOU1EamxrTXZHQ0hNbnZrUjIwQWdKb01NNnRkVk01RVZ6CnRoWUV2MkZ1WDVMeHBiamI5RUlNZEpkWmxSc2lXenRQdjFNK0F2S3dyalozQ29pM2hRakMxaXU3UEJnMG1LNjMKLS0tLS1FTkQgQ0VSVElGSUNBVEUtLS0tLQo=" -> null
      - public_key_type    = "TYPE_X509_PEM_FILE" -> null
      - service_account_id = "projects/hail-295901/serviceAccounts/test-dev@hail-295901.iam.gserviceaccount.com" -> null
      - valid_after        = "2020-11-20T10:50:05Z" -> null
      - valid_before       = "9999-12-31T23:59:59Z" -> null
    }

  # google_service_account_key.test_key will be destroyed
  - resource "google_service_account_key" "test_key" {
      - id                 = "projects/hail-295901/serviceAccounts/test-e454@hail-295901.iam.gserviceaccount.com/keys/ae09cc66d9619d34ba1a05e3607bb371b51ac32c" -> null
      - key_algorithm      = "KEY_ALG_RSA_2048" -> null
      - name               = "projects/hail-295901/serviceAccounts/test-e454@hail-295901.iam.gserviceaccount.com/keys/ae09cc66d9619d34ba1a05e3607bb371b51ac32c" -> null
      - private_key        = (sensitive value)
      - private_key_type   = "TYPE_GOOGLE_CREDENTIALS_FILE" -> null
      - public_key         = "LS0tLS1CRUdJTiBDRVJUSUZJQ0FURS0tLS0tCk1JSUMvRENDQWVTZ0F3SUJBZ0lJSUp2RGVSZTNIbG93RFFZSktvWklodmNOQVFFRkJRQXdJREVlTUJ3R0ExVUUKQXhNVk1URTJNVEV5T1RFME16ZzBPRGsyTWpJME1UTTRNQ0FYRFRJd01URXlNREV3TlRBeE9Wb1lEems1T1RreApNak14TWpNMU9UVTVXakFnTVI0d0hBWURWUVFERXhVeE1UWXhNVEk1TVRRek9EUTRPVFl5TWpReE16Z3dnZ0VpCk1BMEdDU3FHU0liM0RRRUJBUVVBQTRJQkR3QXdnZ0VLQW9JQkFRQzhmU2VCV0owRVU1OFR4aUF1TjViYUdvWTIKUVJ1UDNhRTZwZ3M3YmhlVDZCRThpUWYvVDMyNld4dGVVUjZ4NExlNm9oQy91bkl3cXNZZjA5MGtUMDJKb05sUQp0RytaWHE0Wm94ZmVDL0hDN2JmeDZwcTRZQnBsWTJMWUdodHk1SVNGczd4Y2ZNWTRrR0VXYUhPZDhTRG5PU1BXCkswQmhlakhtdHJkaGZuMXVCS1U4UVBEOXhRZUJvd295dXU1RUdkcllwRFI1bGZJckN0V0JvWjJFL01ENGRjZTYKS2cvZEt1andKVHcyV29aN2t0dVBkc2dGZ3VweHl5OU9CTVA5ZzU2NjVEelRpRkpLQkNlN1psY2tWTFpiK1lhQwpsQVZLQklnMERwTGhYTmp1VTBLeWhkL3pnV0V2NEZ3eElSSnRVaHhCRU1CRjM2bGhwMGU2cVNPby9vb05BZ01CCkFBR2pPREEyTUF3R0ExVWRFd0VCL3dRQ01BQXdEZ1lEVlIwUEFRSC9CQVFEQWdlQU1CWUdBMVVkSlFFQi93UU0KTUFvR0NDc0dBUVVGQndNQ01BMEdDU3FHU0liM0RRRUJCUVVBQTRJQkFRQmdqZ2lhRTMvczU4WEZKU1dZanB0UAp3MnFGNmtxZTAyT3FKSFVDcGIwODhycHU0SDhVZ3B5ZjZrZUd4aEtNZGdVVzJuUjN1ZHZYY3ExclhRRExXZGZFCnNycVNtYWFsT2I2dmtFblJ3QlVMbDZ3QUM0a2k4elVDak53UEh6b2hGRlozbkFlcC91TjhEVVZER3Vxd082dHoKM0dlTllaaHM4MXhVaWY4TlJVNHZPZzYxemZEclFnTWhlVHNqYnN5dlA3K1lXY0ZSWERBQUF1cGluZFZmdk9aKwowbHFYZEdtSy9BQ0xhaXZBUk9ROHFtVnFKcS92anJVV3pNVFR0aXZocjZMZWdERERwTnVrU2Q3TzY5OWhTUUF3CnE1aWlzcDJoUDk0VndkYjRLaHR2RVZkczJHRlphQm9rakgrRkN5d0E0eDkxT3g2bndKQ3VsWkl3NERpS0pnbnEKLS0tLS1FTkQgQ0VSVElGSUNBVEUtLS0tLQo=" -> null
      - public_key_type    = "TYPE_X509_PEM_FILE" -> null
      - service_account_id = "projects/hail-295901/serviceAccounts/test-e454@hail-295901.iam.gserviceaccount.com" -> null
      - valid_after        = "2020-11-20T10:50:19Z" -> null
      - valid_before       = "9999-12-31T23:59:59Z" -> null
    }

  # google_sql_user.db_root will be updated in-place
  ~ resource "google_sql_user" "db_root" {
      - host     = "" -> null
        id       = "root//db-f600d3e5"
        name     = "root"
      # Warning: this attribute value will no longer be marked as sensitive
      # after applying this change
      ~ password = (sensitive value)
        # (2 unchanged attributes hidden)
    }

  # google_storage_bucket.batch_logs will be destroyed
  - resource "google_storage_bucket" "batch_logs" {
      - bucket_policy_only          = true -> null
      - default_event_based_hold    = false -> null
      - force_destroy               = true -> null
      - id                          = "batch-logs-60be" -> null
      - labels                      = {} -> null
      - location                    = "AUSTRALIA-SOUTHEAST1" -> null
      - name                        = "batch-logs-60be" -> null
      - project                     = "hail-295901" -> null
      - requester_pays              = false -> null
      - self_link                   = "https://www.googleapis.com/storage/v1/b/batch-logs-60be" -> null
      - storage_class               = "STANDARD" -> null
      - uniform_bucket_level_access = true -> null
      - url                         = "gs://batch-logs-60be" -> null
    }

  # google_storage_bucket.hail_query will be destroyed
  - resource "google_storage_bucket" "hail_query" {
      - bucket_policy_only          = true -> null
      - default_event_based_hold    = false -> null
      - force_destroy               = true -> null
      - id                          = "hail-query-d2fd" -> null
      - labels                      = {} -> null
      - location                    = "AUSTRALIA-SOUTHEAST1" -> null
      - name                        = "hail-query-d2fd" -> null
      - project                     = "hail-295901" -> null
      - requester_pays              = false -> null
      - self_link                   = "https://www.googleapis.com/storage/v1/b/hail-query-d2fd" -> null
      - storage_class               = "STANDARD" -> null
      - uniform_bucket_level_access = true -> null
      - url                         = "gs://hail-query-d2fd" -> null
    }

  # google_storage_bucket_iam_member.batch_hail_query_bucket_storage_viewer must be replaced
-/+ resource "google_storage_bucket_iam_member" "batch_hail_query_bucket_storage_viewer" {
      ~ bucket = "b/hail-query-d2fd" -> (known after apply) # forces replacement
      ~ etag   = "CAM=" -> (known after apply)
      ~ id     = "b/hail-query-d2fd/roles/storage.objectViewer/serviceaccount:batch-4238@hail-295901.iam.gserviceaccount.com" -> (known after apply)
      ~ member = "serviceAccount:batch-4238@hail-295901.iam.gserviceaccount.com" -> (known after apply) # forces replacement
        # (1 unchanged attribute hidden)
    }

  # google_storage_bucket_iam_member.query_hail_query_bucket_storage_admin must be replaced
-/+ resource "google_storage_bucket_iam_member" "query_hail_query_bucket_storage_admin" {
      ~ bucket = "b/hail-query-d2fd" -> (known after apply) # forces replacement
      ~ etag   = "CAM=" -> (known after apply)
      ~ id     = "b/hail-query-d2fd/roles/storage.admin/serviceaccount:query-fdb4@hail-295901.iam.gserviceaccount.com" -> (known after apply)
      ~ member = "serviceAccount:query-fdb4@hail-295901.iam.gserviceaccount.com" -> (known after apply) # forces replacement
        # (1 unchanged attribute hidden)
    }

  # kubernetes_namespace.ukbb_rg will be destroyed
  - resource "kubernetes_namespace" "ukbb_rg" {
      - id = "ukbb-rg" -> null

      - metadata {
          - annotations      = {} -> null
          - generation       = 0 -> null
          - labels           = {} -> null
          - name             = "ukbb-rg" -> null
          - resource_version = "1182" -> null
          - self_link        = "/api/v1/namespaces/ukbb-rg" -> null
          - uid              = "4f84413b-776c-4a12-91d8-0a68a6a42705" -> null
        }
    }

  # kubernetes_secret.atgu_gsa_key will be destroyed
  - resource "kubernetes_secret" "atgu_gsa_key" {
      - data = (sensitive value)
      - id   = "default/atgu-gsa-key" -> null
      - type = "Opaque" -> null

      - metadata {
          - annotations      = {} -> null
          - generation       = 0 -> null
          - labels           = {} -> null
          - name             = "atgu-gsa-key" -> null
          - namespace        = "default" -> null
          - resource_version = "40581458" -> null
          - self_link        = "/api/v1/namespaces/default/secrets/atgu-gsa-key" -> null
          - uid              = "09d79e1e-1870-46d1-938b-1ce161ec4e41" -> null
        }
    }

  # kubernetes_secret.auth_gsa_key will be destroyed
  - resource "kubernetes_secret" "auth_gsa_key" {
      - data = (sensitive value)
      - id   = "default/auth-gsa-key" -> null
      - type = "Opaque" -> null

      - metadata {
          - annotations      = {} -> null
          - generation       = 0 -> null
          - labels           = {} -> null
          - name             = "auth-gsa-key" -> null
          - namespace        = "default" -> null
          - resource_version = "40581459" -> null
          - self_link        = "/api/v1/namespaces/default/secrets/auth-gsa-key" -> null
          - uid              = "b1278306-75d4-42e6-b9ca-2d1db226bdf2" -> null
        }
    }

  # kubernetes_secret.batch_gsa_key will be destroyed
  - resource "kubernetes_secret" "batch_gsa_key" {
      - data = (sensitive value)
      - id   = "default/batch-gsa-key" -> null
      - type = "Opaque" -> null

      - metadata {
          - annotations      = {} -> null
          - generation       = 0 -> null
          - labels           = {} -> null
          - name             = "batch-gsa-key" -> null
          - namespace        = "default" -> null
          - resource_version = "40581457" -> null
          - self_link        = "/api/v1/namespaces/default/secrets/batch-gsa-key" -> null
          - uid              = "56149ff5-1bee-4bbf-9ac1-d902477d0cde" -> null
        }
    }

  # kubernetes_secret.benchmark_gsa_key will be destroyed
  - resource "kubernetes_secret" "benchmark_gsa_key" {
      - data = (sensitive value)
      - id   = "default/benchmark-gsa-key" -> null
      - type = "Opaque" -> null

      - metadata {
          - annotations      = {} -> null
          - generation       = 0 -> null
          - labels           = {} -> null
          - name             = "benchmark-gsa-key" -> null
          - namespace        = "default" -> null
          - resource_version = "40581456" -> null
          - self_link        = "/api/v1/namespaces/default/secrets/benchmark-gsa-key" -> null
          - uid              = "82b24d7b-5a5b-4913-b593-19a3819cf85b" -> null
        }
    }

  # kubernetes_secret.ci_gsa_key will be destroyed
  - resource "kubernetes_secret" "ci_gsa_key" {
      - data = (sensitive value)
      - id   = "default/ci-gsa-key" -> null
      - type = "Opaque" -> null

      - metadata {
          - annotations      = {} -> null
          - generation       = 0 -> null
          - labels           = {} -> null
          - name             = "ci-gsa-key" -> null
          - namespace        = "default" -> null
          - resource_version = "40581455" -> null
          - self_link        = "/api/v1/namespaces/default/secrets/ci-gsa-key" -> null
          - uid              = "cff03ee7-01cc-4547-a534-345f37773156" -> null
        }
    }

  # kubernetes_secret.database_server_config will be updated in-place
  ~ resource "kubernetes_secret" "database_server_config" {
      ~ data = (sensitive value)
        id   = "default/database-server-config"
        # (1 unchanged attribute hidden)

        # (1 unchanged block hidden)
    }

  # kubernetes_secret.gcr_pull_key will be updated in-place
  ~ resource "kubernetes_secret" "gcr_pull_key" {
      ~ data = (sensitive value)
        id   = "default/gcr-pull-key"
        # (1 unchanged attribute hidden)

        # (1 unchanged block hidden)
    }

  # kubernetes_secret.gcr_push_key will be updated in-place
  ~ resource "kubernetes_secret" "gcr_push_key" {
      ~ data = (sensitive value)
        id   = "default/gcr-push-service-account-key"
        # (1 unchanged attribute hidden)

        # (1 unchanged block hidden)
    }

  # kubernetes_secret.global_config will be updated in-place
  ~ resource "kubernetes_secret" "global_config" {
      ~ data = (sensitive value)
        id   = "default/global-config"
        # (1 unchanged attribute hidden)

        # (1 unchanged block hidden)
    }

  # kubernetes_secret.monitoring_gsa_key will be destroyed
  - resource "kubernetes_secret" "monitoring_gsa_key" {
      - data = (sensitive value)
      - id   = "default/monitoring-gsa-key" -> null
      - type = "Opaque" -> null

      - metadata {
          - annotations      = {} -> null
          - generation       = 0 -> null
          - labels           = {} -> null
          - name             = "monitoring-gsa-key" -> null
          - namespace        = "default" -> null
          - resource_version = "1176" -> null
          - self_link        = "/api/v1/namespaces/default/secrets/monitoring-gsa-key" -> null
          - uid              = "157b679f-86dd-47fa-a36d-a4c37d54a1e7" -> null
        }
    }

  # kubernetes_secret.query_gsa_key will be destroyed
  - resource "kubernetes_secret" "query_gsa_key" {
      - data = (sensitive value)
      - id   = "default/query-gsa-key" -> null
      - type = "Opaque" -> null

      - metadata {
          - annotations      = {} -> null
          - generation       = 0 -> null
          - labels           = {} -> null
          - name             = "query-gsa-key" -> null
          - namespace        = "default" -> null
          - resource_version = "57252554" -> null
          - self_link        = "/api/v1/namespaces/default/secrets/query-gsa-key" -> null
          - uid              = "7e2e4072-aa09-43a6-b0e7-c7dbd0e92246" -> null
        }
    }

  # kubernetes_secret.test_dev_gsa_key will be destroyed
  - resource "kubernetes_secret" "test_dev_gsa_key" {
      - data = (sensitive value)
      - id   = "default/test-dev-gsa-key" -> null
      - type = "Opaque" -> null

      - metadata {
          - annotations      = {} -> null
          - generation       = 0 -> null
          - labels           = {} -> null
          - name             = "test-dev-gsa-key" -> null
          - namespace        = "default" -> null
          - resource_version = "40581454" -> null
          - self_link        = "/api/v1/namespaces/default/secrets/test-dev-gsa-key" -> null
          - uid              = "17e41e29-a38a-4471-9ded-7ff8c931cf41" -> null
        }
    }

  # kubernetes_secret.test_gsa_key will be destroyed
  - resource "kubernetes_secret" "test_gsa_key" {
      - data = (sensitive value)
      - id   = "default/test-gsa-key" -> null
      - type = "Opaque" -> null

      - metadata {
          - annotations      = {} -> null
          - generation       = 0 -> null
          - labels           = {} -> null
          - name             = "test-gsa-key" -> null
          - namespace        = "default" -> null
          - resource_version = "40271087" -> null
          - self_link        = "/api/v1/namespaces/default/secrets/test-gsa-key" -> null
          - uid              = "59b2a641-9a45-4652-9ba2-2aa14741e640" -> null
        }
    }

  # kubernetes_service.ukbb_rb_browser will be destroyed
  - resource "kubernetes_service" "ukbb_rb_browser" {
      - id                    = "ukbb-rg/ukbb-rg-browser" -> null
      - load_balancer_ingress = [] -> null

      - metadata {
          - annotations      = {} -> null
          - generation       = 0 -> null
          - labels           = {
              - "app" = "ukbb-rg-browser"
            } -> null
          - name             = "ukbb-rg-browser" -> null
          - namespace        = "ukbb-rg" -> null
          - resource_version = "1215" -> null
          - self_link        = "/api/v1/namespaces/ukbb-rg/services/ukbb-rg-browser" -> null
          - uid              = "d508bfab-290a-47de-9761-5821365d352c" -> null
        }

      - spec {
          - cluster_ip                  = "10.31.242.63" -> null
          - external_ips                = [] -> null
          - health_check_node_port      = 0 -> null
          - load_balancer_source_ranges = [] -> null
          - publish_not_ready_addresses = false -> null
          - selector                    = {
              - "app" = "ukbb-rg-browser"
            } -> null
          - session_affinity            = "None" -> null
          - type                        = "ClusterIP" -> null

          - port {
              - node_port   = 0 -> null
              - port        = 80 -> null
              - protocol    = "TCP" -> null
              - target_port = "80" -> null
            }
        }
    }

  # kubernetes_service.ukbb_rb_static will be destroyed
  - resource "kubernetes_service" "ukbb_rb_static" {
      - id                    = "ukbb-rg/ukbb-rg-static" -> null
      - load_balancer_ingress = [] -> null

      - metadata {
          - annotations      = {} -> null
          - generation       = 0 -> null
          - labels           = {
              - "app" = "ukbb-rg-static"
            } -> null
          - name             = "ukbb-rg-static" -> null
          - namespace        = "ukbb-rg" -> null
          - resource_version = "1213" -> null
          - self_link        = "/api/v1/namespaces/ukbb-rg/services/ukbb-rg-static" -> null
          - uid              = "d9544f90-e8a7-4fd2-a946-8a98d82a72e4" -> null
        }

      - spec {
          - cluster_ip                  = "10.31.244.199" -> null
          - external_ips                = [] -> null
          - health_check_node_port      = 0 -> null
          - load_balancer_source_ranges = [] -> null
          - publish_not_ready_addresses = false -> null
          - selector                    = {
              - "app" = "ukbb-rg-static"
            } -> null
          - session_affinity            = "None" -> null
          - type                        = "ClusterIP" -> null

          - port {
              - node_port   = 0 -> null
              - port        = 80 -> null
              - protocol    = "TCP" -> null
              - target_port = "80" -> null
            }
        }
    }

  # random_id.atgu_name_suffix will be destroyed
  - resource "random_id" "atgu_name_suffix" {
      - b64_std     = "LgQ=" -> null
      - b64_url     = "LgQ" -> null
      - byte_length = 2 -> null
      - dec         = "11780" -> null
      - hex         = "2e04" -> null
      - id          = "LgQ" -> null
    }

  # random_id.auth_name_suffix will be destroyed
  - resource "random_id" "auth_name_suffix" {
      - b64_std     = "a7k=" -> null
      - b64_url     = "a7k" -> null
      - byte_length = 2 -> null
      - dec         = "27577" -> null
      - hex         = "6bb9" -> null
      - id          = "a7k" -> null
    }

  # random_id.batch_logs_bucket_name_suffix will be destroyed
  - resource "random_id" "batch_logs_bucket_name_suffix" {
      - b64_std     = "YL4=" -> null
      - b64_url     = "YL4" -> null
      - byte_length = 2 -> null
      - dec         = "24766" -> null
      - hex         = "60be" -> null
      - id          = "YL4" -> null
    }

  # random_id.batch_name_suffix will be destroyed
  - resource "random_id" "batch_name_suffix" {
      - b64_std     = "Qjg=" -> null
      - b64_url     = "Qjg" -> null
      - byte_length = 2 -> null
      - dec         = "16952" -> null
      - hex         = "4238" -> null
      - id          = "Qjg" -> null
    }

  # random_id.ci_name_suffix will be destroyed
  - resource "random_id" "ci_name_suffix" {
      - b64_std     = "wdQ=" -> null
      - b64_url     = "wdQ" -> null
      - byte_length = 2 -> null
      - dec         = "49620" -> null
      - hex         = "c1d4" -> null
      - id          = "wdQ" -> null
    }

  # random_id.hail_query_bucket_name_suffix will be destroyed
  - resource "random_id" "hail_query_bucket_name_suffix" {
      - b64_std     = "0v0=" -> null
      - b64_url     = "0v0" -> null
      - byte_length = 2 -> null
      - dec         = "54013" -> null
      - hex         = "d2fd" -> null
      - id          = "0v0" -> null
    }

  # random_id.query_name_suffix will be destroyed
  - resource "random_id" "query_name_suffix" {
      - b64_std     = "/bQ=" -> null
      - b64_url     = "_bQ" -> null
      - byte_length = 2 -> null
      - dec         = "64948" -> null
      - hex         = "fdb4" -> null
      - id          = "_bQ" -> null
    }

  # random_id.test_name_suffix will be destroyed
  - resource "random_id" "test_name_suffix" {
      - b64_std     = "5FQ=" -> null
      - b64_url     = "5FQ" -> null
      - byte_length = 2 -> null
      - dec         = "58452" -> null
      - hex         = "e454" -> null
      - id          = "5FQ" -> null
    }

  # module.atgu_gsa_secret.google_service_account.service_account will be created
  + resource "google_service_account" "service_account" {
      + account_id = (known after apply)
      + email      = (known after apply)
      + id         = (known after apply)
      + name       = (known after apply)
      + project    = (known after apply)
      + unique_id  = (known after apply)
    }

  # module.atgu_gsa_secret.google_service_account_key.service_account_key will be created
  + resource "google_service_account_key" "service_account_key" {
      + id                 = (known after apply)
      + key_algorithm      = "KEY_ALG_RSA_2048"
      + name               = (known after apply)
      + private_key        = (sensitive value)
      + private_key_type   = "TYPE_GOOGLE_CREDENTIALS_FILE"
      + public_key         = (known after apply)
      + public_key_type    = "TYPE_X509_PEM_FILE"
      + service_account_id = (known after apply)
      + valid_after        = (known after apply)
      + valid_before       = (known after apply)
    }

  # module.atgu_gsa_secret.kubernetes_secret.k8s_key will be created
  + resource "kubernetes_secret" "k8s_key" {
      + data = (sensitive value)
      + id   = (known after apply)
      + type = "Opaque"

      + metadata {
          + generation       = (known after apply)
          + name             = "atgu-gsa-key"
          + namespace        = "default"
          + resource_version = (known after apply)
          + self_link        = (known after apply)
          + uid              = (known after apply)
        }
    }

  # module.atgu_gsa_secret.random_id.name_suffix will be created
  + resource "random_id" "name_suffix" {
      + b64_std     = (known after apply)
      + b64_url     = (known after apply)
      + byte_length = 2
      + dec         = (known after apply)
      + hex         = (known after apply)
      + id          = (known after apply)
    }

  # module.auth_gsa_secret.google_project_iam_member.iam_member["iam.serviceAccountAdmin"] will be created
  + resource "google_project_iam_member" "iam_member" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = (known after apply)
      + role    = "roles/iam.serviceAccountAdmin"
    }

  # module.auth_gsa_secret.google_project_iam_member.iam_member["iam.serviceAccountKeyAdmin"] will be created
  + resource "google_project_iam_member" "iam_member" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = (known after apply)
      + role    = "roles/iam.serviceAccountKeyAdmin"
    }

  # module.auth_gsa_secret.google_service_account.service_account will be created
  + resource "google_service_account" "service_account" {
      + account_id = (known after apply)
      + email      = (known after apply)
      + id         = (known after apply)
      + name       = (known after apply)
      + project    = (known after apply)
      + unique_id  = (known after apply)
    }

  # module.auth_gsa_secret.google_service_account_key.service_account_key will be created
  + resource "google_service_account_key" "service_account_key" {
      + id                 = (known after apply)
      + key_algorithm      = "KEY_ALG_RSA_2048"
      + name               = (known after apply)
      + private_key        = (sensitive value)
      + private_key_type   = "TYPE_GOOGLE_CREDENTIALS_FILE"
      + public_key         = (known after apply)
      + public_key_type    = "TYPE_X509_PEM_FILE"
      + service_account_id = (known after apply)
      + valid_after        = (known after apply)
      + valid_before       = (known after apply)
    }

  # module.auth_gsa_secret.kubernetes_secret.k8s_key will be created
  + resource "kubernetes_secret" "k8s_key" {
      + data = (sensitive value)
      + id   = (known after apply)
      + type = "Opaque"

      + metadata {
          + generation       = (known after apply)
          + name             = "auth-gsa-key"
          + namespace        = "default"
          + resource_version = (known after apply)
          + self_link        = (known after apply)
          + uid              = (known after apply)
        }
    }

  # module.auth_gsa_secret.random_id.name_suffix will be created
  + resource "random_id" "name_suffix" {
      + b64_std     = (known after apply)
      + b64_url     = (known after apply)
      + byte_length = 2
      + dec         = (known after apply)
      + hex         = (known after apply)
      + id          = (known after apply)
    }

  # module.batch_gsa_secret.google_project_iam_member.iam_member["compute.instanceAdmin.v1"] will be created
  + resource "google_project_iam_member" "iam_member" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = (known after apply)
      + role    = "roles/compute.instanceAdmin.v1"
    }

  # module.batch_gsa_secret.google_project_iam_member.iam_member["iam.serviceAccountUser"] will be created
  + resource "google_project_iam_member" "iam_member" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = (known after apply)
      + role    = "roles/iam.serviceAccountUser"
    }

  # module.batch_gsa_secret.google_project_iam_member.iam_member["logging.viewer"] will be created
  + resource "google_project_iam_member" "iam_member" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = (known after apply)
      + role    = "roles/logging.viewer"
    }

  # module.batch_gsa_secret.google_project_iam_member.iam_member["storage.admin"] will be created
  + resource "google_project_iam_member" "iam_member" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = (known after apply)
      + role    = "roles/storage.admin"
    }

  # module.batch_gsa_secret.google_service_account.service_account will be created
  + resource "google_service_account" "service_account" {
      + account_id = (known after apply)
      + email      = (known after apply)
      + id         = (known after apply)
      + name       = (known after apply)
      + project    = (known after apply)
      + unique_id  = (known after apply)
    }

  # module.batch_gsa_secret.google_service_account_key.service_account_key will be created
  + resource "google_service_account_key" "service_account_key" {
      + id                 = (known after apply)
      + key_algorithm      = "KEY_ALG_RSA_2048"
      + name               = (known after apply)
      + private_key        = (sensitive value)
      + private_key_type   = "TYPE_GOOGLE_CREDENTIALS_FILE"
      + public_key         = (known after apply)
      + public_key_type    = "TYPE_X509_PEM_FILE"
      + service_account_id = (known after apply)
      + valid_after        = (known after apply)
      + valid_before       = (known after apply)
    }

  # module.batch_gsa_secret.kubernetes_secret.k8s_key will be created
  + resource "kubernetes_secret" "k8s_key" {
      + data = (sensitive value)
      + id   = (known after apply)
      + type = "Opaque"

      + metadata {
          + generation       = (known after apply)
          + name             = "batch-gsa-key"
          + namespace        = "default"
          + resource_version = (known after apply)
          + self_link        = (known after apply)
          + uid              = (known after apply)
        }
    }

  # module.batch_gsa_secret.random_id.name_suffix will be created
  + resource "random_id" "name_suffix" {
      + b64_std     = (known after apply)
      + b64_url     = (known after apply)
      + byte_length = 2
      + dec         = (known after apply)
      + hex         = (known after apply)
      + id          = (known after apply)
    }

  # module.batch_logs.google_storage_bucket.bucket will be created
  + resource "google_storage_bucket" "bucket" {
      + bucket_policy_only          = (known after apply)
      + force_destroy               = true
      + id                          = (known after apply)
      + location                    = "AUSTRALIA-SOUTHEAST1"
      + name                        = (known after apply)
      + project                     = (known after apply)
      + self_link                   = (known after apply)
      + storage_class               = "REGIONAL"
      + uniform_bucket_level_access = (known after apply)
      + url                         = (known after apply)
    }

  # module.batch_logs.random_id.bucket_prefix will be created
  + resource "random_id" "bucket_prefix" {
      + b64_std     = (known after apply)
      + b64_url     = (known after apply)
      + byte_length = 5
      + dec         = (known after apply)
      + hex         = (known after apply)
      + id          = (known after apply)
    }

  # module.benchmark_gsa_secret.google_service_account.service_account will be created
  + resource "google_service_account" "service_account" {
      + account_id = (known after apply)
      + email      = (known after apply)
      + id         = (known after apply)
      + name       = (known after apply)
      + project    = (known after apply)
      + unique_id  = (known after apply)
    }

  # module.benchmark_gsa_secret.google_service_account_key.service_account_key will be created
  + resource "google_service_account_key" "service_account_key" {
      + id                 = (known after apply)
      + key_algorithm      = "KEY_ALG_RSA_2048"
      + name               = (known after apply)
      + private_key        = (sensitive value)
      + private_key_type   = "TYPE_GOOGLE_CREDENTIALS_FILE"
      + public_key         = (known after apply)
      + public_key_type    = "TYPE_X509_PEM_FILE"
      + service_account_id = (known after apply)
      + valid_after        = (known after apply)
      + valid_before       = (known after apply)
    }

  # module.benchmark_gsa_secret.kubernetes_secret.k8s_key will be created
  + resource "kubernetes_secret" "k8s_key" {
      + data = (sensitive value)
      + id   = (known after apply)
      + type = "Opaque"

      + metadata {
          + generation       = (known after apply)
          + name             = "benchmark-gsa-key"
          + namespace        = "default"
          + resource_version = (known after apply)
          + self_link        = (known after apply)
          + uid              = (known after apply)
        }
    }

  # module.benchmark_gsa_secret.random_id.name_suffix will be created
  + resource "random_id" "name_suffix" {
      + b64_std     = (known after apply)
      + b64_url     = (known after apply)
      + byte_length = 2
      + dec         = (known after apply)
      + hex         = (known after apply)
      + id          = (known after apply)
    }

  # module.ci_gsa_secret.google_service_account.service_account will be created
  + resource "google_service_account" "service_account" {
      + account_id = (known after apply)
      + email      = (known after apply)
      + id         = (known after apply)
      + name       = (known after apply)
      + project    = (known after apply)
      + unique_id  = (known after apply)
    }

  # module.ci_gsa_secret.google_service_account_key.service_account_key will be created
  + resource "google_service_account_key" "service_account_key" {
      + id                 = (known after apply)
      + key_algorithm      = "KEY_ALG_RSA_2048"
      + name               = (known after apply)
      + private_key        = (sensitive value)
      + private_key_type   = "TYPE_GOOGLE_CREDENTIALS_FILE"
      + public_key         = (known after apply)
      + public_key_type    = "TYPE_X509_PEM_FILE"
      + service_account_id = (known after apply)
      + valid_after        = (known after apply)
      + valid_before       = (known after apply)
    }

  # module.ci_gsa_secret.kubernetes_secret.k8s_key will be created
  + resource "kubernetes_secret" "k8s_key" {
      + data = (sensitive value)
      + id   = (known after apply)
      + type = "Opaque"

      + metadata {
          + generation       = (known after apply)
          + name             = "ci-gsa-key"
          + namespace        = "default"
          + resource_version = (known after apply)
          + self_link        = (known after apply)
          + uid              = (known after apply)
        }
    }

  # module.ci_gsa_secret.random_id.name_suffix will be created
  + resource "random_id" "name_suffix" {
      + b64_std     = (known after apply)
      + b64_url     = (known after apply)
      + byte_length = 2
      + dec         = (known after apply)
      + hex         = (known after apply)
      + id          = (known after apply)
    }

  # module.grafana_gsa_secret.google_service_account.service_account will be created
  + resource "google_service_account" "service_account" {
      + account_id = (known after apply)
      + email      = (known after apply)
      + id         = (known after apply)
      + name       = (known after apply)
      + project    = (known after apply)
      + unique_id  = (known after apply)
    }

  # module.grafana_gsa_secret.google_service_account_key.service_account_key will be created
  + resource "google_service_account_key" "service_account_key" {
      + id                 = (known after apply)
      + key_algorithm      = "KEY_ALG_RSA_2048"
      + name               = (known after apply)
      + private_key        = (sensitive value)
      + private_key_type   = "TYPE_GOOGLE_CREDENTIALS_FILE"
      + public_key         = (known after apply)
      + public_key_type    = "TYPE_X509_PEM_FILE"
      + service_account_id = (known after apply)
      + valid_after        = (known after apply)
      + valid_before       = (known after apply)
    }

  # module.grafana_gsa_secret.kubernetes_secret.k8s_key will be created
  + resource "kubernetes_secret" "k8s_key" {
      + data = (sensitive value)
      + id   = (known after apply)
      + type = "Opaque"

      + metadata {
          + generation       = (known after apply)
          + name             = "grafana-gsa-key"
          + namespace        = "default"
          + resource_version = (known after apply)
          + self_link        = (known after apply)
          + uid              = (known after apply)
        }
    }

  # module.grafana_gsa_secret.random_id.name_suffix will be created
  + resource "random_id" "name_suffix" {
      + b64_std     = (known after apply)
      + b64_url     = (known after apply)
      + byte_length = 2
      + dec         = (known after apply)
      + hex         = (known after apply)
      + id          = (known after apply)
    }

  # module.hail_query.google_storage_bucket.bucket will be created
  + resource "google_storage_bucket" "bucket" {
      + bucket_policy_only          = (known after apply)
      + force_destroy               = true
      + id                          = (known after apply)
      + location                    = "AUSTRALIA-SOUTHEAST1"
      + name                        = (known after apply)
      + project                     = (known after apply)
      + self_link                   = (known after apply)
      + storage_class               = "REGIONAL"
      + uniform_bucket_level_access = (known after apply)
      + url                         = (known after apply)
    }

  # module.hail_query.random_id.bucket_prefix will be created
  + resource "random_id" "bucket_prefix" {
      + b64_std     = (known after apply)
      + b64_url     = (known after apply)
      + byte_length = 5
      + dec         = (known after apply)
      + hex         = (known after apply)
      + id          = (known after apply)
    }

  # module.hail_test_gcs_bucket.google_storage_bucket.bucket will be created
  + resource "google_storage_bucket" "bucket" {
      + bucket_policy_only          = (known after apply)
      + force_destroy               = true
      + id                          = (known after apply)
      + location                    = "AUSTRALIA-SOUTHEAST1"
      + name                        = (known after apply)
      + project                     = (known after apply)
      + self_link                   = (known after apply)
      + storage_class               = "REGIONAL"
      + uniform_bucket_level_access = (known after apply)
      + url                         = (known after apply)
    }

  # module.hail_test_gcs_bucket.random_id.bucket_prefix will be created
  + resource "random_id" "bucket_prefix" {
      + b64_std     = (known after apply)
      + b64_url     = (known after apply)
      + byte_length = 5
      + dec         = (known after apply)
      + hex         = (known after apply)
      + id          = (known after apply)
    }

  # module.monitoring_gsa_secret.google_service_account.service_account will be created
  + resource "google_service_account" "service_account" {
      + account_id = (known after apply)
      + email      = (known after apply)
      + id         = (known after apply)
      + name       = (known after apply)
      + project    = (known after apply)
      + unique_id  = (known after apply)
    }

  # module.monitoring_gsa_secret.google_service_account_key.service_account_key will be created
  + resource "google_service_account_key" "service_account_key" {
      + id                 = (known after apply)
      + key_algorithm      = "KEY_ALG_RSA_2048"
      + name               = (known after apply)
      + private_key        = (sensitive value)
      + private_key_type   = "TYPE_GOOGLE_CREDENTIALS_FILE"
      + public_key         = (known after apply)
      + public_key_type    = "TYPE_X509_PEM_FILE"
      + service_account_id = (known after apply)
      + valid_after        = (known after apply)
      + valid_before       = (known after apply)
    }

  # module.monitoring_gsa_secret.kubernetes_secret.k8s_key will be created
  + resource "kubernetes_secret" "k8s_key" {
      + data = (sensitive value)
      + id   = (known after apply)
      + type = "Opaque"

      + metadata {
          + generation       = (known after apply)
          + name             = "monitoring-gsa-key"
          + namespace        = "default"
          + resource_version = (known after apply)
          + self_link        = (known after apply)
          + uid              = (known after apply)
        }
    }

  # module.monitoring_gsa_secret.random_id.name_suffix will be created
  + resource "random_id" "name_suffix" {
      + b64_std     = (known after apply)
      + b64_url     = (known after apply)
      + byte_length = 2
      + dec         = (known after apply)
      + hex         = (known after apply)
      + id          = (known after apply)
    }

  # module.query_gsa_secret.google_service_account.service_account will be created
  + resource "google_service_account" "service_account" {
      + account_id = (known after apply)
      + email      = (known after apply)
      + id         = (known after apply)
      + name       = (known after apply)
      + project    = (known after apply)
      + unique_id  = (known after apply)
    }

  # module.query_gsa_secret.google_service_account_key.service_account_key will be created
  + resource "google_service_account_key" "service_account_key" {
      + id                 = (known after apply)
      + key_algorithm      = "KEY_ALG_RSA_2048"
      + name               = (known after apply)
      + private_key        = (sensitive value)
      + private_key_type   = "TYPE_GOOGLE_CREDENTIALS_FILE"
      + public_key         = (known after apply)
      + public_key_type    = "TYPE_X509_PEM_FILE"
      + service_account_id = (known after apply)
      + valid_after        = (known after apply)
      + valid_before       = (known after apply)
    }

  # module.query_gsa_secret.kubernetes_secret.k8s_key will be created
  + resource "kubernetes_secret" "k8s_key" {
      + data = (sensitive value)
      + id   = (known after apply)
      + type = "Opaque"

      + metadata {
          + generation       = (known after apply)
          + name             = "query-gsa-key"
          + namespace        = "default"
          + resource_version = (known after apply)
          + self_link        = (known after apply)
          + uid              = (known after apply)
        }
    }

  # module.query_gsa_secret.random_id.name_suffix will be created
  + resource "random_id" "name_suffix" {
      + b64_std     = (known after apply)
      + b64_url     = (known after apply)
      + byte_length = 2
      + dec         = (known after apply)
      + hex         = (known after apply)
      + id          = (known after apply)
    }

  # module.test_dev_gsa_secret.google_service_account.service_account will be created
  + resource "google_service_account" "service_account" {
      + account_id = (known after apply)
      + email      = (known after apply)
      + id         = (known after apply)
      + name       = (known after apply)
      + project    = (known after apply)
      + unique_id  = (known after apply)
    }

  # module.test_dev_gsa_secret.google_service_account_key.service_account_key will be created
  + resource "google_service_account_key" "service_account_key" {
      + id                 = (known after apply)
      + key_algorithm      = "KEY_ALG_RSA_2048"
      + name               = (known after apply)
      + private_key        = (sensitive value)
      + private_key_type   = "TYPE_GOOGLE_CREDENTIALS_FILE"
      + public_key         = (known after apply)
      + public_key_type    = "TYPE_X509_PEM_FILE"
      + service_account_id = (known after apply)
      + valid_after        = (known after apply)
      + valid_before       = (known after apply)
    }

  # module.test_dev_gsa_secret.kubernetes_secret.k8s_key will be created
  + resource "kubernetes_secret" "k8s_key" {
      + data = (sensitive value)
      + id   = (known after apply)
      + type = "Opaque"

      + metadata {
          + generation       = (known after apply)
          + name             = "test-dev-gsa-key"
          + namespace        = "default"
          + resource_version = (known after apply)
          + self_link        = (known after apply)
          + uid              = (known after apply)
        }
    }

  # module.test_dev_gsa_secret.random_id.name_suffix will be created
  + resource "random_id" "name_suffix" {
      + b64_std     = (known after apply)
      + b64_url     = (known after apply)
      + byte_length = 2
      + dec         = (known after apply)
      + hex         = (known after apply)
      + id          = (known after apply)
    }

  # module.test_gsa_secret.google_project_iam_member.iam_member["compute.instanceAdmin.v1"] will be created
  + resource "google_project_iam_member" "iam_member" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = (known after apply)
      + role    = "roles/compute.instanceAdmin.v1"
    }

  # module.test_gsa_secret.google_project_iam_member.iam_member["iam.serviceAccountUser"] will be created
  + resource "google_project_iam_member" "iam_member" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = (known after apply)
      + role    = "roles/iam.serviceAccountUser"
    }

  # module.test_gsa_secret.google_project_iam_member.iam_member["logging.viewer"] will be created
  + resource "google_project_iam_member" "iam_member" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = (known after apply)
      + role    = "roles/logging.viewer"
    }

  # module.test_gsa_secret.google_project_iam_member.iam_member["serviceusage.serviceUsageConsumer"] will be created
  + resource "google_project_iam_member" "iam_member" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = (known after apply)
      + role    = "roles/serviceusage.serviceUsageConsumer"
    }

  # module.test_gsa_secret.google_service_account.service_account will be created
  + resource "google_service_account" "service_account" {
      + account_id = (known after apply)
      + email      = (known after apply)
      + id         = (known after apply)
      + name       = (known after apply)
      + project    = (known after apply)
      + unique_id  = (known after apply)
    }

  # module.test_gsa_secret.google_service_account_key.service_account_key will be created
  + resource "google_service_account_key" "service_account_key" {
      + id                 = (known after apply)
      + key_algorithm      = "KEY_ALG_RSA_2048"
      + name               = (known after apply)
      + private_key        = (sensitive value)
      + private_key_type   = "TYPE_GOOGLE_CREDENTIALS_FILE"
      + public_key         = (known after apply)
      + public_key_type    = "TYPE_X509_PEM_FILE"
      + service_account_id = (known after apply)
      + valid_after        = (known after apply)
      + valid_before       = (known after apply)
    }

  # module.test_gsa_secret.kubernetes_secret.k8s_key will be created
  + resource "kubernetes_secret" "k8s_key" {
      + data = (sensitive value)
      + id   = (known after apply)
      + type = "Opaque"

      + metadata {
          + generation       = (known after apply)
          + name             = "test-gsa-key"
          + namespace        = "default"
          + resource_version = (known after apply)
          + self_link        = (known after apply)
          + uid              = (known after apply)
        }
    }

  # module.test_gsa_secret.random_id.name_suffix will be created
  + resource "random_id" "name_suffix" {
      + b64_std     = (known after apply)
      + b64_url     = (known after apply)
      + byte_length = 2
      + dec         = (known after apply)
      + hex         = (known after apply)
      + id          = (known after apply)
    }

  # module.ukbb.kubernetes_namespace.ukbb_rg will be created
  + resource "kubernetes_namespace" "ukbb_rg" {
      + id = (known after apply)

      + metadata {
          + generation       = (known after apply)
          + name             = "ukbb-rg"
          + resource_version = (known after apply)
          + self_link        = (known after apply)
          + uid              = (known after apply)
        }
    }

  # module.ukbb.kubernetes_service.ukbb_rb_browser will be created
  + resource "kubernetes_service" "ukbb_rb_browser" {
      + id                    = (known after apply)
      + load_balancer_ingress = (known after apply)

      + metadata {
          + generation       = (known after apply)
          + labels           = {
              + "app" = "ukbb-rg-browser"
            }
          + name             = "ukbb-rg-browser"
          + namespace        = "ukbb-rg"
          + resource_version = (known after apply)
          + self_link        = (known after apply)
          + uid              = (known after apply)
        }

      + spec {
          + cluster_ip                  = (known after apply)
          + external_traffic_policy     = (known after apply)
          + health_check_node_port      = (known after apply)
          + publish_not_ready_addresses = false
          + selector                    = {
              + "app" = "ukbb-rg-browser"
            }
          + session_affinity            = "None"
          + type                        = "ClusterIP"

          + port {
              + node_port   = (known after apply)
              + port        = 80
              + protocol    = "TCP"
              + target_port = "80"
            }
        }
    }

  # module.ukbb.kubernetes_service.ukbb_rb_static will be created
  + resource "kubernetes_service" "ukbb_rb_static" {
      + id                    = (known after apply)
      + load_balancer_ingress = (known after apply)

      + metadata {
          + generation       = (known after apply)
          + labels           = {
              + "app" = "ukbb-rg-static"
            }
          + name             = "ukbb-rg-static"
          + namespace        = "ukbb-rg"
          + resource_version = (known after apply)
          + self_link        = (known after apply)
          + uid              = (known after apply)
        }

      + spec {
          + cluster_ip                  = (known after apply)
          + external_traffic_policy     = (known after apply)
          + health_check_node_port      = (known after apply)
          + publish_not_ready_addresses = false
          + selector                    = {
              + "app" = "ukbb-rg-static"
            }
          + session_affinity            = "None"
          + type                        = "ClusterIP"

          + port {
              + node_port   = (known after apply)
              + port        = 80
              + protocol    = "TCP"
              + target_port = "80"
            }
        }
    }

Plan: 68 to add, 5 to change, 60 to destroy.

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.
```